## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.istioingress-rbac-role will be created
+   resource "kubernetes_manifest" "istioingress-rbac-role" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           rules      = [
+               {
+                   apiGroups = [
+                       "",
                    ]
+                   resources = [
+                       "secrets",
                    ]
+                   verbs     = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           rules      = [
+               {
+                   apiGroups       = [
+                       "",
                    ]
+                   nonResourceURLs = (known after apply)
+                   resourceNames   = (known after apply)
+                   resources       = [
+                       "secrets",
                    ]
+                   verbs           = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
    }

  # kubernetes_manifest.istioingress-service will be created
+   resource "kubernetes_manifest" "istioingress-service" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               labels    = {
+                   app   = "istio-ingressgateway"
+                   istio = "ingressgateway"
                }
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               ports    = [
+                   {
+                       name       = "status-port"
+                       port       = 15021
+                       protocol   = "TCP"
+                       targetPort = 15021
                    },
+                   {
+                       name = "http2"
+                       port = 80
                    },
+                   {
+                       name = "https"
+                       port = 443
                    },
                ]
+               selector = {
+                   app   = "istio-ingressgateway"
+                   istio = "ingressgateway"
                }
+               type     = "LoadBalancer"
            }
        }
+       object   = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               allocateLoadBalancerNodePorts = (known after apply)
+               clusterIP                     = (known after apply)
+               clusterIPs                    = (known after apply)
+               externalIPs                   = (known after apply)
+               externalName                  = (known after apply)
+               externalTrafficPolicy         = (known after apply)
+               healthCheckNodePort           = (known after apply)
+               internalTrafficPolicy         = (known after apply)
+               ipFamilies                    = (known after apply)
+               ipFamilyPolicy                = (known after apply)
+               loadBalancerClass             = (known after apply)
+               loadBalancerIP                = (known after apply)
+               loadBalancerSourceRanges      = (known after apply)
+               ports                         = [
+                   {
+                       appProtocol = (known after apply)
+                       name        = "status-port"
+                       nodePort    = (known after apply)
+                       port        = 15021
+                       protocol    = "TCP"
+                       targetPort  = "15021"
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "http2"
+                       nodePort    = (known after apply)
+                       port        = 80
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "https"
+                       nodePort    = (known after apply)
+                       port        = 443
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
                ]
+               publishNotReadyAddresses      = (known after apply)
+               selector                      = {
+                   "app"   = "istio-ingressgateway"
+                   "istio" = "ingressgateway"
                }
+               sessionAffinity               = (known after apply)
+               sessionAffinityConfig         = {
+                   clientIP = {
+                       timeoutSeconds = (known after apply)
                    }
                }
+               type                          = "LoadBalancer"
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
